{"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 64], "dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "masking_1", "class_name": "Masking", "config": {"name": "masking_1", "trainable": true, "mask_value": 0.0}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "gru_1", "class_name": "GRU", "config": {"name": "gru_1", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "units": 32, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["masking_1", 0, 0, {}]]]}, {"name": "crf_1", "class_name": "CRF", "config": {"name": "crf_1", "trainable": true, "units": 5, "learn_mode": "join", "test_mode": "viterbi", "use_boundary": true, "use_bias": true, "sparse_target": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "chain_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "boundary_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": null, "chain_regularizer": null, "boundary_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "chain_constraint": null, "boundary_constraint": null, "bias_constraint": null, "input_dim": 32, "unroll": false}, "inbound_nodes": [[["gru_1", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["crf_1", 0, 0]]}, "keras_version": "2.0.8", "backend": "tensorflow"}